app/controllers/projects_controller.rb

    def index
        @title = 'all_projects'
        @sorting = params[:sort]
        @path = 'projects_path'
        if @sorting == 'year'
            @projects = Project.order('year DESC,semester DESC').all.paginate(page: params[:page])
        else
            @projects = Project.order(@sorting).all.paginate(page: params[:page])
---
SELECT COUNT(*) FROM "projects"
SELECT  "projects".* FROM "projects" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]