app/controllers/reset_controller.rb

SELECT  "projects".* FROM "projects" ORDER BY year DESC,semester DESC LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "projects"
---
    def index
        @projects = Project.order('year DESC,semester DESC').all.paginate(page: params[:page])

SELECT "projects".* FROM "projects"
SELECT  "assignments".* FROM "assignments" WHERE "assignments"."project_id" = ? LIMIT ?  [["project_id", 1], ["LIMIT", 1]]
SELECT "relationships".* FROM "relationships" WHERE "relationships"."team_id" IS NULL
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 103], ["LIMIT", 1]]
---
    def downloadAndReset
        # Download Projects
        projects = Project.all
        i = 1
        data = "SNo, Project Title, Semester, Organization, Contact, Description, Students who worked on the Project, Github Link, Heroku Link, Pivotal Tracker\n"
        projects.each do |p|
            student_data = ""
            team_info = Assignment.find_by_project_id(p.id)
            team_number = team_info.team_id unless team_info.nil?
            @student_info = Relationship.where(team_id: team_number)
            if !@student_info.nil?
                @student_info.each do |student|
                    firstname = User.find_by_id(student.user_id).firstname

SELECT "projects".* FROM "projects" WHERE "projects"."isactive" = ?  [["isactive", "t"]]
UPDATE "projects" SET "islegacy" = ?, "semester" = ?, "year" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["islegacy", "t"], ["semester", "Fall"], ["year", "2021"], ["updated_at", "2020-05-01 19:43:04.081608"], ["id", 5]]
DELETE FROM "assignments"
DELETE FROM "users" WHERE "users"."admin" = ?  [["admin", "f"]]
DELETE FROM "preassignments"
DELETE FROM "preferences"
DELETE FROM "relationships"
SELECT  "projects".* FROM "projects" ORDER BY year DESC,semester DESC LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "projects"
---
    def migrate

        @year = params[:year]
        @semester = params[:semester]

        puts "Migration in progress"
        active_projects = Project.where(isactive: true)
        active_projects.each do |project|
            project.islegacy = true
            # Handle migration of semester to the next.
            # TODO: First update the semester/year as part of migration UI.
            project.semester = @semester
            project.year = @year
            project.save
        end

        # reset the DBs
        Assignment.delete_all
        User.where(admin: false).delete_all
        Preassignment.delete_all
        Preference.delete_all
        Relationship.delete_all
        Team.delete_all

        @projects = Project.order('year DESC,semester DESC').all.paginate(page: params[:page])