app/controllers/sessions_controller.rb

    def create # Local login method
        user = User.find_by(email: params[:session][:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "admin@example.com"], ["LIMIT", 1]]