app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams"
SELECT COUNT(*) FROM "relationships" WHERE "relationships"."team_id" = ?  [["team_id", 1]]
SELECT "assignments".* FROM "assignments" WHERE "assignments"."team_id" = ?  [["team_id", 1]]
SELECT  "teams".* FROM "teams" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "teams"
---
    def index
        if current_user.admin?
            @counts = {}
            @leaders = {}
            @status = {}
            @preferences = {}
            @teams = Team.all

            @teams.each do |team|
                count = Relationship.where(team_id: team.id).count
                @counts[team.id] = count
                @leaders[team.id] = team.leader
                @preferences[team.id] = team.preferences_filled ? '&#9989;' : '&#10060;'
                @status[team.id] = (Assignment.where(team_id: team.id).blank? ? 'No' : 'Yes')
            end # end do

            @sorting = params[:sort]

            session[:assignorder] = true unless session.key?(:assignorder)

            if @sorting == 'assigned'
                unassigned_teams = @teams.select {|x| @status[x.id] == 'No'}
                assigned_teams = @teams.reject {|x| @status[x.id] == 'No'}

                if session[:assignorder] == false
                    @teams = (unassigned_teams + assigned_teams).paginate(page: params[:page])

SELECT "users".* FROM "users"
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? AND "relationships"."user_id" = ? LIMIT ?  [["user_id", 1], ["user_id", 1], ["LIMIT", 1]]
---

        if current_user.admin?
            @team_members = {}
            User.all.each do |user|
                res = Relationship.find_by_user_id(user.id)