app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE ((firstname LIKE '%Eino%') OR (lastname LIKE '%Eino%')) LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE ((firstname LIKE '%Eino%') OR (lastname LIKE '%Eino%'))
---
  def index
    # @users = User.order("lower(name) ASC").all.paginate(page: params[:page])
    # @users = User.order("lower(uin) ASC").all.paginate(page: params[:page])
    @sorting = params[:sort]

    @users = User.all

    @teams = {}

    @users.each do |user|
      res = Relationship.find_by_user_id(user.id)
      @teams[user.id] = (Team.find_by_id(res.team_id) unless res.nil?)
    end

    session[:teamorder] = nil unless session.key?(:teamorder)

    if @sorting == 'currteam'
      nil_team_users = @users.select { |x| @teams[x.id].nil? }
      other_team_users = @users.reject { |x| @teams[x.id].nil? }

      if session[:teamorder] == false
        @users = (other_team_users + nil_team_users).paginate(page: params[:page])