app/controllers/users_controller.rb

    def index
        if params[:search_by].nil? and params[:sort_by].nil?
            session[:search_by] = nil
            session[:search_by] = nil
            session[:search] = nil
        end

        session[:search_by] = nil unless session.key?(:search_by)
        session[:search] = nil unless session.key?(:search)

        @sorting = params[:sort_by]

        @search = params[:search] || session[:search]
        @search_by = params[:search_by] || session[:search_by]  # If 1st expression is not nil/true, return it. If the 1st expression is nil/false, return the 2nd expression

        session[:search_by] = @search_by
        session[:search] = @search

        if session[:search_by] == '1' # Search using UIN
            @users = User.search_by_uin(session[:search])
        elsif session[:search_by] == '2' # Search using Name
            @users = User.search_by_name(session[:search])
        elsif session[:search_by] == '3' #Search using Team Name
            @users = User.search_by_currteam(session[:search])
        else
            @users = User.all
---
SELECT  "teams".* FROM "teams" WHERE "teams"."name" = ? LIMIT ?  [["name", "Oregon"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE ((firstname LIKE '%Eino%') OR (lastname LIKE '%Eino%'))

            @teams = {}

            @users.each do |user|
                res = Relationship.find_by_user_id(user.id)
                @teams[user.id] = (Team.find_by_id(res.team_id) unless res.nil?)
---
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? AND "relationships"."user_id" = ? LIMIT ?  [["user_id", 1], ["user_id", 1], ["LIMIT", 1]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "relationships".* FROM "relationships" WHERE "relationships"."team_id" = ?  [["team_id", 44]]

    def no_team
        @users = []
        @teams = {}

        User.all.each do |user|
            res = Relationship.find_by_user_id(user.id)
---
SELECT "users".* FROM "users"
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? AND "relationships"."user_id" = ? LIMIT ?  [["user_id", 1], ["user_id", 1], ["LIMIT", 1]]

    def delete_all
        User.all.each do |user|
            if !user.admin
                User.find(user.id).destroy
---
SELECT "users".* FROM "users"
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]